freebsd/kyua/testers/kyua-tap-interface.7
.\" Copyright 2013 Google Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions are
.\" met:
.\"
.\" * Redistributions of source code must retain the above copyright
.\"   notice, this list of conditions and the following disclaimer.
.\" * Redistributions in binary form must reproduce the above copyright
.\"   notice, this list of conditions and the following disclaimer in the
.\"   documentation and/or other materials provided with the distribution.
.\" * Neither the name of Google Inc. nor the names of its contributors
.\"   may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
.\" A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
.\" OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
.\" SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
.\" LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
.\" OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.Dd September 13, 2014
.Dt KYUA-TAP-INTERFACE 7
.Os
.Sh NAME
.Nm "kyua tap-interface"
.Nd Description of the TAP test program interface
.Sh DESCRIPTION
The
.Em Test Anything Protocol
is a simple text-based protocol that allows the communication of a test
program with a test engine as part of the test's
.Em execution .
More details on the protocol can be found here:
.Bd -literal -offset indent
http://podwiki.hexten.net/TAP/TAP.html
.Ed
.Pp
A TAP-compliant test program has one or more test cases, although
unfortunately it is not possible to query what these are without actually
running the tests.  The practical implication of this is that Kyua will
treat all bundled tests as a single unit.
.Pp
The results of a TAP test program are one of the following:
.Bl -tag -width passedXX
.It passed
If all test cases within the program report
.Sq ok .
.It failed
If all test cases within the program report
.Sq not ok .
.It broken
If the output of the test program is not well-formed according to the TAP
specification, or if the test program crashes or times out.
.El
.Ss Configuration varibles
The test engine may pass run-time configuration variables to the test program
via the environment.  The name of the configuration variable is prefixed with
.Sq TEST_ENV_
so that a configuration variable of the form
.Sq foo=bar
becomes accessible in the environment as
.Sq TEST_ENV_foo=bar .
.Ss Isolation
TAP-compliant test programs are executed with the same isolation features as
ATF test programs; see
.Xr kyua-atf-interface 7 .
.Sh SEE ALSO
.Xr kyua-test 1 ,
.Xr kyuafile 5 ,
.Xr kyua-atf-interface 7
